[
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qab4p",
    "parent_id": "1mc0b3n",
    "author": "jaynepierce",
    "body": "If you keep your head on a swivel and are generally street smart you will likely be fine anywhere. But to be safe I would avoid downtown LA.\n\nBased on what you say you like, I’d try to aim for like echo park/los feliz/silverlake area. Or if you prefer a beachier vibe, Venice or Santa Monica.",
    "score": 10,
    "created_utc": 1753758735.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qab4p/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qac3x",
    "parent_id": "1mc0b3n",
    "author": "EngineDependent9328",
    "body": "LA, and Southern California is a rather large sprawling area. There are pockets of areas you want to steer clear from, but outside of some rough neighborhoods southern California is a beautiful place. I grew up in what is now South Central, which is a very bad place to have to live. \n\nit might be easier if we knew where you might want to visit and can give recommendations based on that. My favorites were the beaches(many outside of \"LA\", but still part of the southern California community that are fun to see)\n\nThere are a lot of clubs that are still around in Hollywood that are where giant bands started their careers.\n\nMany great museums if you are into that. I also always take people up to Griffiths Observatory since it is so common to see in movies and TV. \n\nif you have more specific things you'd like to see I can be more helpful. Bottom line is its a big area and some places are not safe for tourists to stay in, no matter how cheap the hotel might be.",
    "score": 3,
    "created_utc": 1753758746.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qac3x/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qalzl",
    "parent_id": "1mc0b3n",
    "author": "Hot-Parsley-6193",
    "body": "Go to the Museum of Jurassic Technology!",
    "score": 3,
    "created_utc": 1753758855.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qalzl/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5r9wi5",
    "parent_id": "n5qalzl",
    "author": "joshuaherman",
    "body": "Why would you play a joke on an innocent person and waste their time and money?\n\nIf you have seen every other part of Los Angeles and are bored, sure go, but even then I swear it’s some inside joke that the museum isn’t telling anyone.",
    "score": -5,
    "created_utc": 1753776413.0,
    "depth": 1,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5r9wi5/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5q931k",
    "parent_id": "1mc0b3n",
    "author": "vonkluver",
    "body": "Depends on what you plan on doing all that time.",
    "score": 2,
    "created_utc": 1753758256.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5q931k/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qar9y",
    "parent_id": "1mc0b3n",
    "author": "filmAF",
    "body": "venice beach to the west, or los feliz/silverlake to the east. both are fun and artsy. i prefer venice because i like being near the ocean. but most of my friends are in silverlake.",
    "score": 2,
    "created_utc": 1753758912.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qar9y/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qi1l6",
    "parent_id": "1mc0b3n",
    "author": "nnairek",
    "body": "Venice — check out Abbott Kinney (shopping/dining), Townhouse (nightlife), and The Venice Whaler (food/drinks with beach views). Check for vintage or flea markets, farmers markets, or food trucks in Abbot Kinney, etc while you’re in town. Walk the beach. Casablanca (restaurant) is a gem for Mexican nearby. \n\nCruise up PCH to Malibu if you’re able to!\n\nSanta Monica is just north and Marina Del Ray and Manhattan Beach are south. Cute spots. \n\nI stayed in West Hollywood (Sunset Blvd.) once but the traffic to get to Venice was wild. I’m from out of state and felt perfectly safe in both areas. West Hollywood is fun, but Venice is better.",
    "score": 2,
    "created_utc": 1753761919.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qi1l6/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qc0q9",
    "parent_id": "1mc0b3n",
    "author": "CrazyBox49",
    "body": "Lots of great choices! Anything on the west side should be fine- Venice, Santa Monica, or any of the beach cities a little further south. Could also do something like Los Feliz or Glendale if that’s closer to the activities you want to do. Only places that I don’t recommend to tourists are Downtown LA and Hollywood Blvd.",
    "score": 1,
    "created_utc": 1753759418.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qc0q9/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qecqw",
    "parent_id": "1mc0b3n",
    "author": "BeLOUD321",
    "body": "Look to see if any bands or concerts you love are in town",
    "score": 1,
    "created_utc": 1753760371.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qecqw/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qh3da",
    "parent_id": "1mc0b3n",
    "author": "Jackielanterrn",
    "body": "I’d say Venice silver lake or Los feliz from what you’re saying.",
    "score": 1,
    "created_utc": 1753761512.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qh3da/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5qv93g",
    "parent_id": "1mc0b3n",
    "author": "tttrrrooommm",
    "body": "Check out the Gold Line Bar in Highland park.  It’s an epic vinyl listening bar owned by Stones throw records. Super sick spot\n\nhttps://maps.app.goo.gl/NQiiuG8NXfbM2J2U9?g_st=ipc\n\nRight next door is The Lodge Room which is a great small venue with well curated musical acts and bands\n\nhttps://maps.app.goo.gl/5vLvmgwyf73ozFoL6?g_st=ipc\n\n\nAnd again down the street is highland park bowl which is a really cool old school bowling alley\n\nhttps://maps.app.goo.gl/GTCgt1r4CXi684eeA?g_st=ipc\n\nHighland park is a sick neighborhood and if you go to that general area, you can easily hit these three spots and make an evening out of it",
    "score": 1,
    "created_utc": 1753768233.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5qv93g/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5rje1p",
    "parent_id": "1mc0b3n",
    "author": "aussiewlw",
    "body": "Figure out an itinerary on what you plan on doing in LA because you’ll want to be as close to those locations as possible. Getting around is so expensive and the public transport isn’t as good as Melbourne. \n\nI stayed in an “unsafe” area in LA the whole 3 months I was there and I never felt unsafe tbh but probably because I was with my American partner at the time. You’ll be fine in pretty much most areas but of course choose somewhere reasonable according to your plans.",
    "score": 1,
    "created_utc": 1753781953.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5rje1p/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5stlyu",
    "parent_id": "1mc0b3n",
    "author": "CeeDooly",
    "body": "Take a walking tour of the downtown area during the day.  Many beautiful iconic things to see.",
    "score": 1,
    "created_utc": 1753799875.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5stlyu/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5ty2x3",
    "parent_id": "1mc0b3n",
    "author": "Ceorl_Lounge",
    "body": "We stayed in Westwood and Atwater Village last year, both were safe, walkable, and relatively clean (for a city the size of LA). My biggest recommendation is to have an idea of where you're going/what you're doing and plan to minimize driving. I certainly wouldn't stay in Hollywood, but there are some nice neighborhoods not too far from there.",
    "score": 1,
    "created_utc": 1753811118.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5ty2x3/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n62vbut",
    "parent_id": "1mc0b3n",
    "author": "kitecto",
    "body": "I’m biased, but try Culver City Helms Bakery area.  Walkable, bike paths, hiking close by.  Lots of restaurants, some weekends there are art walks along the local art galleries.  Also very central to lots of other LA neighborhoods in all directions, as well as close to the Expo metro stop.",
    "score": 1,
    "created_utc": 1753921586.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n62vbut/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n75mje6",
    "parent_id": "1mc0b3n",
    "author": "johnanthonysmillions",
    "body": "based on your interests, i would definitely aim to stay somewhere in los feliz, silver lake, or echo park. you will then be a short uber ride from all 3 neighborhoods, as well as frogtown, highland park, and dtla. as someone who’s lived on the eastside for 15 years and shares those same interests, this is the move.\n\ni wouldn’t waste your time with hollywood and anywhere west of hollywood.\n\nLA (even public transportation) is actually safe, contrary to what a lot of people claim. some people just don’t feel safe around homeless people. as long as you mind your own business, you’re fine. the amount of homeless people (especially in dtla) can be a culture shock for some.\n\nsome fun bar/venues that usually have great music on a nightly basis are zebulon and permanent records roadhouse. you can check out resident advisor if you’re interested in after hours music stuff.\n\nsome other random recs in that general side of town..\n\nbars:\ncrawfords\nshim sham\nel prado\n4100\ncha cha\nbar flores\n\nfood:\nhomestate\ndoubting thomas\nsqirl\nleo’s tacos\ndan sung sa\nquarter sheets pizza\n\nparks:\nbarnsdall\necho park lake\nsilver lake meadow\ngriffith park\n\nhappy to provide more specific recs if you’d like. there’s so much, and this side of town is going to be your best bet.",
    "score": 1,
    "created_utc": 1754444661.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n75mje6/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5ragbu",
    "parent_id": "1mc0b3n",
    "author": "joshuaherman",
    "body": "Don’t go wondering around Hollywood blvd at night. Same goes for the fashion district and the east side of downtown. Santa Monica is safe place to stay and has access to trains during the day, but try to take Uber at night. \n\nI know this may sound scary, but LA is actually okay. It might even be worth it to rent a car.",
    "score": 1,
    "created_utc": 1753776733.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5ragbu/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5r2kgv",
    "parent_id": "1mc0b3n",
    "author": "Catastrophic-Event",
    "body": "LA is just kind of a hole lol. Everyone not from here is excited to see it, but yeah... it's a shitty place with random areas of cool. Typical bunch of shit to do because it's a massive city, but homelessness like crazy, crackheads all over, etc etc.",
    "score": -3,
    "created_utc": 1753772224.0,
    "depth": 0,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5r2kgv/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5stfd0",
    "parent_id": "n5r2kgv",
    "author": "CeeDooly",
    "body": "This is just so not true.  There are places with homelessness, but SO much of the larger LA area is beautiful and safe.",
    "score": 5,
    "created_utc": 1753799822.0,
    "depth": 1,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5stfd0/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5tpg21",
    "parent_id": "n5r2kgv",
    "author": "AnotherPint",
    "body": "Don't be absurd.",
    "score": 2,
    "created_utc": 1753808793.0,
    "depth": 1,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5tpg21/"
  },
  {
    "post_id": "1mc0b3n",
    "comment_id": "n5uhsgq",
    "parent_id": "n5tpg21",
    "author": "Catastrophic-Event",
    "body": "Nothing absurd about it lol. While you're walking down the bivd dodging the meth hookers, don't trip over the homeless guy and fall in a pool of piss onto a dirty needle.​\n\nedit: this is if you don't get grabbed by ICE and deported for no reason at all.",
    "score": -1,
    "created_utc": 1753816582.0,
    "depth": 2,
    "permalink": "https://www.reddit.com/r/travel/comments/1mc0b3n/los_angeles_advice_needed/n5uhsgq/"
  }
]